{
    "grade9":[
        {"courseName":"Canadian &", "courseCode":"CGC1D1", "courseDiscription":"Students will investigate the interconnections among the landforms, climate, soils, plants, animals and human activities in Canadian ecozones to develop geographic knowledge and skills that contribute to an understanding of Canada's diversity and its role in the world."},
        {"courseName":"English", "courseCode":"ENLW1", "courseDiscription":"Have you ever been told that you need “Canadian experience” to get a job in Canada? The Enhanced Language Training (ELT) program bridges newcomers’ professional backgrounds with new careers in Toronto – for free. Gain industry-specific instruction, networking, and work placement opportunities in any of these sectors: Accounting; Office Administration and Customer Relations; Engineering; Financial Services; Health and Wellness; Information Technology; and Sales and Marketing."},
        {"courseName":"Core French, Academi", "courseCode":"FSF1D1", "courseDiscription":"The FSF1D1 course is designed to provide students with communication skills in French and foster a positive attitude toward the French language and culture. This course prepares students for the FSF2D1 (Grade 10 French) course."},
        {"courseName":"Core French, Introductory", "courseCode":"FSF1O1", "courseDiscription":"Students will begin to understand and speak French in guided and structured interactive settings, and will develop fundamental skills in listening, speaking, reading, and writing through discussing issues and situations that are relevant to their daily lives."},
        {"courseName":"Mathematics", "courseCode":"MTH1W1", "courseDiscription":"This course enables students to consolidate, and continue to develop, an understanding of mathematical concepts related to number sense and operations, algebra, measurement, geometry, data, probability, and financial literacy."},
        {"courseName":"Science", "courseCode":"SNC1W1", "courseDiscription":"This course enables students to develop their understanding of concepts related to biology, chemistry, physics, and earth and space science, and to relate science to technology, society, and the environment."},
        {"courseName":"Drama", "courseCode":"ADA1O1", "courseDiscription":"ADA1O is an introductory course to the dramatic arts. Students are provided with opportunities to explore dramatic forms and techniques, using material from a wide range of sources and cultures."},
        {"courseName":"V/A - Expressions of Aboriginal Cultures", "courseCode":"NAC1O1", "courseDiscription":"This course explores various arts disciplines, giving students the opportunity to create, present, and analyse art works, including integrated art works/ productions, that explore or reflect First Nations, Métis, and Inuit perspectives and cultures."},
        {"courseName":"Instrumental Music - Band (e.g., trumpet, flute, trombone, etc.)", "courseCode":"AMI1O1", "courseDiscription":"This course emphasizes the creation and performance of music at a level consistent with previous experience. Students will develop musical literacy skills by using the creative and critical analysis processes in composition, performance and a range of reflective and analytical activities."},
        {"courseName":"Music Repertoire", "courseCode":"AMR1O1", "courseDiscription":"This is the Grade 9 Band Ensemble course that is taken in conjunction with AMI 1O1 (Grade 9 Band).  It is scheduled outside of the regular school day, and includes rehearsals and performances with the Ensemble."},
        {"courseName":"Instrumental Music: Strings (e.g., violin, viola, cello, bass)", "courseCode":"AMS1O1", "courseDiscription":"This course emphasizes the creation and performance of music at a level consistent with previous experience. Students will develop musical literacy skills by using the creative and critical analysis processes in composition, performance and a range of reflective and analytical activities."},
        {"courseName":"Business", "courseCode":"BTT1O1", "courseDiscription":"In this course, students will have the opportunity to develop their digital literacy, including effective electronic research and communication skills. They will also explore current issues related to the impact of information and communication technology."},
        {"courseName":"Learning Strategies", "courseCode":"GLS1O1", "courseDiscription":"Students will learn how to develop and apply literacy and numeracy skills, personal- management skills, and interpersonal and teamwork skills to improve their learning and achievement in school, the workplace, and the community."},
        {"courseName":"Tech Education", "courseCode":"TIJ1O1", "courseDiscription":"Students will develop an awareness of environmental and societal issues, and will begin to explore secondary and postsecondary education and training pathways leading to careers in technology-related fields."}
    ],

    "grade10":[
        {"courseName":"Dramatic Arts", "courseCode":"ADA2O1", "courseDiscription": "The Grade 10 Dramatic Arts course requires students to explore dramatic forms and techniques, using their own ideas and concerns as well as ideas in sources selected from a wide range of genres, texts (used in the broadest sense), forms and cultures."},
        {"courseName":"Instrumental Music - Guitar ", "courseCode":"AMG2O1", "courseDiscription":"This course emphasizes the creation and performance of music at a level consistent with previous experience. Students will develop musical literacy skills by using the creative and critical analysis processes in composition, performance and a range of reflective and analytical activities."},
        {"courseName":"Instrumental Music - Band (e.g., trumpet, flute, trombone, etc.) ", "courseCode":"AMI2O1", "courseDiscription":"This course emphasizes the creation and performance of music at a level consistent with previous experience. Students will develop musical literacy skills by using the creative and critical analysis processes in composition, performance and a range of reflective and analytical activities."},
        {"courseName":"Music Repertoire", "courseCode":"AMR2O1", "courseDiscription":"This is the Grade 10 Senior Band Ensemble course that is taken in conjunction with AMI 2O1 (Grade 10 Band).  It is scheduled outside of the regular school day, and includes rehearsals and performances with the Ensemble."},
        {"courseName":"Instrumental Music - Strings (e.g. violin, viola, cello, bass)", "courseCode":"AMS2O1", "courseDiscription":"This course emphasizes the creation and performance of music at a level consistent with previous experience. Students will develop musical literacy skills by using the creative and critical analysis processes in composition, performance and a range of reflective and analytical activities."},
        {"courseName":"Instrumental Music - Strings (e.g. violin, viola, cello, bass) ", "courseCode":"ATC2O1", "courseDiscription":"Experiences in the arts _ dance, drama, media arts, music, and the visual arts – play a valuable role in the education of all students. Through participation in the arts, students can develop their creativity, learn about their own identity, and develop self-awareness, self-confidence, and a sense of well-being. Since artistic activities involve intense engagement, students experience a sense of wonder and joy when learning through the arts, which can motivate them to participate more fully in cultural life and in other educational opportunities. "},
        {"courseName":"Dance ", "courseCode":"AVI2O1", "courseDiscription":"This course is exploratory in nature, offering an overview of visual arts as a foundation for further study. Students will become familiar with the elements and principles of design and the expressive qualities of various materials by using a range of media, processes, techniques, and styles."},
        {"courseName":"Business", "courseCode":"BB12O1", "courseDiscription": "Level 1 English as a Second Language (ESLAO) builds on students previous education and language knowledge to introduce them to the English language and help them adjust to the diversity in their new environment. Students will use beginning English language skills in listening, speaking, reading, and writing for everyday and essential academic purposes. They will engage in short conversations using basic English language structures and simple sentence patterns; read short adapted texts; and write phrases and short sentences. The course also provides students with the knowledge and skills they need to begin to adapt to their new lives in Canada."},
        {"courseName":"Canadian & World  Studies", "courseCode":"CHC2D1", "courseDiscription":"This course explores social, economic, and political developments and events and their impact on the lives of different individuals, groups, and communities, including First Nations, Métis, and Inuit individuals and communities, in Canada since 1914."},
        {"courseName":"Computer Studies", "courseCode":"ICD201", "courseDiscription":"This course will provide architects, specifiers, and façade consultants education about silicone-based spandrel glass coating technologies. Attendees will learn about the risks of thermal stress breakage due to ceramic frit's weakening effects on heat-treated glass"},
        {"courseName":"English, Academic", "courseCode":"ENG2D1", "courseDiscription":"This course is designed to extend the range of oral communication, reading, writing, and media literacy skills that students need for success in their secondary school academic programs and in their daily lives."},
        {"courseName":"English Literacy", "courseCode":"ELS201", "courseDiscription":"Students will read informational, graphic, and literary texts, with a focus on locating information, identifying main ideas and supporting details, building vocabulary, and consolidating skills in the application of key comprehension strategies. The course will also help students develop core learning strategies."},
        {"courseName":"Core French, Academic", "courseCode":"FSFD1", "courseDiscription":"Students will develop their skills in listening, speaking, reading, and writing by using language learning strategies introduced in the elementary Core French program, and will apply creative and critical thinking skills in various ways."},
        {"courseName":"Career Studies & Civics, Open", "courseCode":"CIVCAR", "courseDiscription":"This course explores rights and responsibilities associated with being an active citizen in a democratic society. Students will explore issues of civic importance such as healthy schools, community planning, environmental responsibility, and the influence of social media, while developing their understanding of the role of civic engagement and of political processes in the local, national, and/or global community. Students will apply the concepts of political thinking and the political inquiry process to investigate, and express informed opinions about, a range of political issues and developments that are both of significance in today's world and of personal interest to them."},
        {"courseName":"Personal Fitness - Female/Male", "courseCode":"PAF20F/M", "courseDiscription":"This course focuses on the development of a personalized approach to healthy active living through participation in a variety of enjoyable fitness related activities. This course will emphasise personal fitness through weight training, cross training and cardio-respiratory training."},
        {"courseName":"Healthy Active Living - Female/Male", "courseCode":"PPL20F/M", "courseDiscription": "Level 1 English as a Second Language (ESLAO) builds on students previous education and language knowledge to introduce them to the English language and help them adjust to the diversity in their new environment. Students will use beginning English language skills in listening, speaking, reading, and writing for everyday and essential academic purposes. They will engage in short conversations using basic English language structures and simple sentence patterns; read short adapted texts; and write phrases and short sentences. The course also provides students with the knowledge and skills they need to begin to adapt to their new lives in Canada."},
        {"courseName":"Spanish", "courseCode":"LWSBD1", "courseDiscription":"This course provides opportunities for students to begin to develop and apply skills in listening, speaking, reading, and writing in the language of study."},
        {"courseName":"Math, Academic", "courseCode":"MPM2D1", "courseDiscription":"This course enables students to broaden their understanding of relationships and extend their problem-solving and algebraic skills through investigation, the effective use of technology, and abstract reasoning."},
        {"courseName":"Science, Academic", "courseCode":"SNC2D1", "courseDiscription":"This course enables students to enhance their understanding of concepts in biology, chemistry, earth and space science, and physics, and of the interrelationships between science, technology, society, and the environment. Students are also given opportunities to further develop their scientific investigation skills."},
        {"courseName":"Food and Nutrition", "courseCode":"HFN201", "courseDiscription":"Students will learn how to make informed food choices and how to prepare foods, and will investigate our Canadian food heritage and food industries, as well as global food issues."},
        {"courseName":"Construction Technology", "courseCode":"TCJ201", "courseDiscription":"These courses enable students to develop technical knowledge and skills related to carpentry, masonry, electrical systems, heating and cooling, and plumbing for residential construction."},
        {"courseName":"Transportation Technology", "courseCode":"TTJ201", "courseDiscription":"This course provides students with opportunities to apply a design process to meet a variety of technological challenges. Students will research projects, create designs, build models and/or prototypes, and assess products and/or processes using appropriate tools, techniques, and strategies."},
        {"courseName":"Computer Technology", "courseCode":"TEJ201", "courseDiscription":"Students will build small electronic circuits and write computer programs to control simple peripheral devices or robots. Students will also develop an awareness of related environmental and societal issues, and will learn about secondary and postsecondary pathways and career opportunities in computer technology. Al."}

    ],

    "grade11":[
        {"couresName":"World Religions", "courseCode":"HRF3O1", "courseDiscription": "This course enables students to study world religions and belief traditions in local, Canadian and global contexts. Students will explore aspects of the human quest for meaning and will examine world religions and belief traditions as exemplified in various sacred teachings and principles, rites and passages."},
        {"couresName":"Food & Culture", "courseCode":"HFC3M1", "courseDiscription": ""},
        {"couresName":"Introduction to Anthropology & Psychology and Sociology", "courseCode":"HSP3U1", "courseDiscription": "This course provides students with opportunities to think critically about theories, questions, and issues related to anthropology, psychology, and sociology. Students will develop an understanding of the approaches and researchmethods used by social scientists. They will be given opportunities to explore theories from a variety of perspectives, to conduct social science research, and to become familiar with current thinking on a range of issues within the three disciplines"},
        {"couresName":"Peter", "courseCode":"ENG2D1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"CHC2D1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"HZB3M1", "courseDiscription": ""},
        {"courseName":"John", "courseCode":"CGC1D1", "courseDiscription": ""},
        {"courseName":"John", "courseCode":"CGC1P1", "courseDiscription": ""},
        {"courseName":"John", "courseCode":"CHG381", "courseDiscription": ""},
        {"courseName":"John", "courseCode":"CHC2D1", "courseDiscription": ""},
        {"courseName":"John", "courseCode":"CHC2P1", "courseDiscription": ""},
        {"courseName":"John", "courseCode":"CHA3U1", "courseDiscription": ""},
        {"courseName":"John", "courseCode":"CHC2D1", "courseDiscription": ""},
        {"courseName":"Anna", "courseCode":"CHC2P1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"CLU3M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"CHC2D1", "courseDiscription": ""},
        {"courseName":"John", "courseCode":"CHC2P1", "courseDiscription": ""},
        {"courseName":"Anna", "courseCode":"ENG3CE", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"ENG3U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"ENG3UE", "courseDiscription": ""},
        {"courseName":"John", "courseCode":"ENG3E1", "courseDiscription": ""},
        {"courseName":"Anna", "courseCode":"EPS3O1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"FSF3U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"FSF2D1", "courseDiscription": ""},
        {"courseName":"John", "courseCode":"PAI3O1", "courseDiscription": ""},
        {"courseName":"Anna", "courseCode":"PAF3OF/M", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"PPL3OF/M", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"MCF3M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"MPM2D1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"MFM2P1", "courseDiscription": ""},
        {"courseName":"John", "courseCode":"MCR3U1", "courseDiscription": ""},
        {"courseName":"Anna", "courseCode":"MPM2D1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"MCF3M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"MBF3C1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"MEL3E1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"MTH1W1", "courseDiscription": ""},
        {"courseName":"John", "courseCode":"MAT2L1", "courseDiscription": ""},
        {"courseName":"Anna", "courseCode":"SBI3C1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"SNC2P1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"SNC2D1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"SBI3U1", "courseDiscription": ""},
        {"courseName":"John", "courseCode":"SCH3U1", "courseDiscription": ""},
        {"courseName":"John", "courseCode":"SPH3U1", "courseDiscription": ""},
        {"courseName":"Anna", "courseCode":"SVN3E1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"HRF3O1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"HFC3M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"HSP3U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"HZB3M1", "courseDiscription": ""},
        {"courseName":"Anna", "courseCode":"TCJ3C1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"TCJ2O1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"TTJ3C1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"TTJ2O1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"TEJ3M1", "courseDiscription": ""},
        {"courseName":"John", "courseCode":"TEJ2O1 ", "courseDiscription": ""}
    ],

    "grade12":[
        {"courseName":"John", "courseCode":"ADA4M1", "courseDiscription": ""},
        {"courseName":"Anna", "courseCode":"ADA3M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"AMI4M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"AMI3M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"AMK4M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"AMK3M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"AMR4M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"AMR3M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"AMS4M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"AMS3M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"AVI4M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"AVI3M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"AWQ4M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"AWQ3M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"BAT4M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"BAF3M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"BAT4M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"BAF3M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"BBB4M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"BOH4M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"CLN4U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"CGR4M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"ICS3U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"ENG4C1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"ENG3C1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"ENG4U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"ENG3U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"ENG4E1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"ENG3E1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"EWC4C1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"ENG3C1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"FSF4U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"FSF3U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"PAF4OF/M", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"PPL4OF/M", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"PLF4M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"PSK4U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"IDC4UM", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"MAP4C1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"MBF3C1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"MEL4E1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"MEL3E1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"MCV4U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"MHF4U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"MDM4U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"MCR3U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"MCF3M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"MHF4U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"MCR3U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"SBI4U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"SBI3U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"SCH3U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"SCH4C1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"SNC2P1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"SNC2D1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"SCH4U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"SCH3U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"SPH4U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"SPH3U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"HIP4O1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"HFA4C1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"HFA4U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"HFL4E1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"HSB4U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"HZT4U1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"TTJ4C1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"TEJ4M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"TCJ4C1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"TEJ3M1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"TTJ3C1", "courseDiscription": ""},
        {"couresName":"Peter", "courseCode":"TCJ3C1", "courseDiscription": ""}


    ],

    "special": [
        {"courseName":"English As a Second Language, ESL LEVEL 1, Open", "courseCode":"ESLAO8", "courseDiscription": "Level 1 English as a Second Language (ESLAO) builds on students previous education and language knowledge to introduce them to the English language and help them adjust to the diversity in their new environment. Students will use beginning English language skills in listening, speaking, reading, and writing for everyday and essential academic purposes. They will engage in short conversations using basic English language structures and simple sentence patterns; read short adapted texts; and write phrases and short sentences. The course also provides students with the knowledge and skills they need to begin to adapt to their new lives in Canada."},
        {"courseName":"English as a Second Language, ESL Level 2, Open", "courseCode":"ESLBO8", "courseDiscription": "Students will participate in conversations in structured situations on a variety of familiar and new topics; read a variety of texts designed or adapted for English language learners; expand their knowledge of English grammatical structures and sentence patterns; and link English sentences to compose paragraphs."},
        {"courseName":"English for School and Work, ESL Level 3, Open", "courseCode":"ESLCO8", "courseDiscription": "This course is designed to improve students' accuracy in using English in classroom situations, for personal and career planning, and to understand the changing world around them. Students will study and interpret a range of texts and produce a variety of forms of writing."},
        {"courseName":"English for School and Work, ESL Level 4, Open", "courseCode":"ESLDO8", "courseDiscription": "Course Overview. ESLDO online prepares students to use English with increasing fluency and accuracy in classroom and social situations and to participate in Canadian society as informed citizens. Students will develop the oral-presentation, reading, and writing skills required for success in all school subjects."},
        {"courseName":"Anna", "courseCode":"COOPPM", "courseDiscription": "This course consists of a learning experience connected to a community and a cooperative education curriculum focused on developing skills, knowledge, and habits of mind that will support students in their learning, including their education and career/life planning, at school and beyond, today and in the future."},
        {"courseName":"Anna", "courseCode":"OLC4O1", "courseDiscription": "This course is designed to help students acquire and demonstrate the cross-curricular literacy skills that are evaluated by the Ontario Secondary School Literacy Test (OSSLT). Students who complete the course successfully will meet the provincial literacy requirement for graduation."}

    ]
}