{
    "grade9":[
        {"courseName":"Canadian &", "courseCode":"CGC1D1", "courseDiscription":"Students will investigate the interconnections among the landforms, climate, soils, plants, animals and human activities in Canadian ecozones to develop geographic knowledge and skills that contribute to an understanding of Canada's diversity and its role in the world."},
        {"courseName":"English", "courseCode":"ENLW1", "courseDiscription":"Have you ever been told that you need “Canadian experience” to get a job in Canada? The Enhanced Language Training (ELT) program bridges newcomers’ professional backgrounds with new careers in Toronto – for free. Gain industry-specific instruction, networking, and work placement opportunities in any of these sectors: Accounting; Office Administration and Customer Relations; Engineering; Financial Services; Health and Wellness; Information Technology; and Sales and Marketing."},
        {"courseName":"Core French, Academi", "courseCode":"FSF1D1", "courseDiscription":"The FSF1D1 course is designed to provide students with communication skills in French and foster a positive attitude toward the French language and culture. This course prepares students for the FSF2D1 (Grade 10 French) course."},
        {"courseName":"Core French, Introductory", "courseCode":"FSF1O1", "courseDiscription":"Students will begin to understand and speak French in guided and structured interactive settings, and will develop fundamental skills in listening, speaking, reading, and writing through discussing issues and situations that are relevant to their daily lives."},
        {"courseName":"Mathematics", "courseCode":"MTH1W1", "courseDiscription":"This course enables students to consolidate, and continue to develop, an understanding of mathematical concepts related to number sense and operations, algebra, measurement, geometry, data, probability, and financial literacy."},
        {"courseName":"Science", "courseCode":"SNC1W1", "courseDiscription":"This course enables students to develop their understanding of concepts related to biology, chemistry, physics, and earth and space science, and to relate science to technology, society, and the environment."},
        {"courseName":"Drama", "courseCode":"ADA1O1", "courseDiscription":"ADA1O is an introductory course to the dramatic arts. Students are provided with opportunities to explore dramatic forms and techniques, using material from a wide range of sources and cultures."},
        {"courseName":"V/A - Expressions of Aboriginal Cultures", "courseCode":"NAC1O1", "courseDiscription":"This course explores various arts disciplines, giving students the opportunity to create, present, and analyse art works, including integrated art works/ productions, that explore or reflect First Nations, Métis, and Inuit perspectives and cultures."},
        {"courseName":"Instrumental Music - Band (e.g., trumpet, flute, trombone, etc.)", "courseCode":"AMI1O1", "courseDiscription":"This course emphasizes the creation and performance of music at a level consistent with previous experience. Students will develop musical literacy skills by using the creative and critical analysis processes in composition, performance and a range of reflective and analytical activities."},
        {"courseName":"Music Repertoire", "courseCode":"AMR1O1", "courseDiscription":"This is the Grade 9 Band Ensemble course that is taken in conjunction with AMI 1O1 (Grade 9 Band).  It is scheduled outside of the regular school day, and includes rehearsals and performances with the Ensemble."},
        {"courseName":"Instrumental Music: Strings (e.g., violin, viola, cello, bass)", "courseCode":"AMS1O1", "courseDiscription":"This course emphasizes the creation and performance of music at a level consistent with previous experience. Students will develop musical literacy skills by using the creative and critical analysis processes in composition, performance and a range of reflective and analytical activities."},
        {"courseName":"Business", "courseCode":"BTT1O1", "courseDiscription":"In this course, students will have the opportunity to develop their digital literacy, including effective electronic research and communication skills. They will also explore current issues related to the impact of information and communication technology."},
        {"courseName":"Learning Strategies", "courseCode":"GLS1O1", "courseDiscription":"Students will learn how to develop and apply literacy and numeracy skills, personal- management skills, and interpersonal and teamwork skills to improve their learning and achievement in school, the workplace, and the community."},
        {"courseName":"Tech Education", "courseCode":"TIJ1O1", "courseDiscription":"Students will develop an awareness of environmental and societal issues, and will begin to explore secondary and postsecondary education and training pathways leading to careers in technology-related fields."}
    ],

    "grade10":[
        {"courseName":"Dramatic Arts", "courseCode":"ADA2O1", "courseDiscription": "The Grade 10 Dramatic Arts course requires students to explore dramatic forms and techniques, using their own ideas and concerns as well as ideas in sources selected from a wide range of genres, texts (used in the broadest sense), forms and cultures."},
        {"courseName":"Instrumental Music - Guitar ", "courseCode":"AMG2O1", "courseDiscription":"This course emphasizes the creation and performance of music at a level consistent with previous experience. Students will develop musical literacy skills by using the creative and critical analysis processes in composition, performance and a range of reflective and analytical activities."},
        {"courseName":"Instrumental Music - Band (e.g., trumpet, flute, trombone, etc.) ", "courseCode":"AMI2O1", "courseDiscription":"This course emphasizes the creation and performance of music at a level consistent with previous experience. Students will develop musical literacy skills by using the creative and critical analysis processes in composition, performance and a range of reflective and analytical activities."},
        {"courseName":"Music Repertoire", "courseCode":"AMR2O1", "courseDiscription":"This is the Grade 10 Senior Band Ensemble course that is taken in conjunction with AMI 2O1 (Grade 10 Band).  It is scheduled outside of the regular school day, and includes rehearsals and performances with the Ensemble."},
        {"courseName":"Instrumental Music - Strings (e.g. violin, viola, cello, bass)", "courseCode":"AMS2O1", "courseDiscription":"This course emphasizes the creation and performance of music at a level consistent with previous experience. Students will develop musical literacy skills by using the creative and critical analysis processes in composition, performance and a range of reflective and analytical activities."},
        {"courseName":"Instrumental Music - Strings (e.g. violin, viola, cello, bass) ", "courseCode":"ATC2O1", "courseDiscription":"Experiences in the arts _ dance, drama, media arts, music, and the visual arts – play a valuable role in the education of all students. Through participation in the arts, students can develop their creativity, learn about their own identity, and develop self-awareness, self-confidence, and a sense of well-being. Since artistic activities involve intense engagement, students experience a sense of wonder and joy when learning through the arts, which can motivate them to participate more fully in cultural life and in other educational opportunities. "},
        {"courseName":"Dance ", "courseCode":"AVI2O1", "courseDiscription":"This course is exploratory in nature, offering an overview of visual arts as a foundation for further study. Students will become familiar with the elements and principles of design and the expressive qualities of various materials by using a range of media, processes, techniques, and styles."},
        {"courseName":"Business", "courseCode":"BB12O1", "courseDiscription": "Level 1 English as a Second Language (ESLAO) builds on students previous education and language knowledge to introduce them to the English language and help them adjust to the diversity in their new environment. Students will use beginning English language skills in listening, speaking, reading, and writing for everyday and essential academic purposes. They will engage in short conversations using basic English language structures and simple sentence patterns; read short adapted texts; and write phrases and short sentences. The course also provides students with the knowledge and skills they need to begin to adapt to their new lives in Canada."},
        {"courseName":"Canadian & World  Studies", "courseCode":"CHC2D1", "courseDiscription":"This course explores social, economic, and political developments and events and their impact on the lives of different individuals, groups, and communities, including First Nations, Métis, and Inuit individuals and communities, in Canada since 1914."},
        {"courseName":"Computer Studies", "courseCode":"ICD201", "courseDiscription":"This course will provide architects, specifiers, and façade consultants education about silicone-based spandrel glass coating technologies. Attendees will learn about the risks of thermal stress breakage due to ceramic frit's weakening effects on heat-treated glass"},
        {"courseName":"English, Academic", "courseCode":"ENG2D1", "courseDiscription":"This course is designed to extend the range of oral communication, reading, writing, and media literacy skills that students need for success in their secondary school academic programs and in their daily lives."},
        {"courseName":"English Literacy", "courseCode":"ELS201", "courseDiscription":"Students will read informational, graphic, and literary texts, with a focus on locating information, identifying main ideas and supporting details, building vocabulary, and consolidating skills in the application of key comprehension strategies. The course will also help students develop core learning strategies."},
        {"courseName":"Core French, Academic", "courseCode":"FSFD1", "courseDiscription":"Students will develop their skills in listening, speaking, reading, and writing by using language learning strategies introduced in the elementary Core French program, and will apply creative and critical thinking skills in various ways."},
        {"courseName":"Career Studies & Civics, Open", "courseCode":"CIVCAR", "courseDiscription":"This course explores rights and responsibilities associated with being an active citizen in a democratic society. Students will explore issues of civic importance such as healthy schools, community planning, environmental responsibility, and the influence of social media, while developing their understanding of the role of civic engagement and of political processes in the local, national, and/or global community. Students will apply the concepts of political thinking and the political inquiry process to investigate, and express informed opinions about, a range of political issues and developments that are both of significance in today's world and of personal interest to them."},
        {"courseName":"Personal Fitness - Female/Male", "courseCode":"PAF20F/M", "courseDiscription":"This course focuses on the development of a personalized approach to healthy active living through participation in a variety of enjoyable fitness related activities. This course will emphasise personal fitness through weight training, cross training and cardio-respiratory training."},
        {"courseName":"Healthy Active Living - Female/Male", "courseCode":"PPL20F/M", "courseDiscription": "Level 1 English as a Second Language (ESLAO) builds on students previous education and language knowledge to introduce them to the English language and help them adjust to the diversity in their new environment. Students will use beginning English language skills in listening, speaking, reading, and writing for everyday and essential academic purposes. They will engage in short conversations using basic English language structures and simple sentence patterns; read short adapted texts; and write phrases and short sentences. The course also provides students with the knowledge and skills they need to begin to adapt to their new lives in Canada."},
        {"courseName":"Spanish", "courseCode":"LWSBD1", "courseDiscription":"This course provides opportunities for students to begin to develop and apply skills in listening, speaking, reading, and writing in the language of study."},
        {"courseName":"Math, Academic", "courseCode":"MPM2D1", "courseDiscription":"This course enables students to broaden their understanding of relationships and extend their problem-solving and algebraic skills through investigation, the effective use of technology, and abstract reasoning."},
        {"courseName":"Science, Academic", "courseCode":"SNC2D1", "courseDiscription":"This course enables students to enhance their understanding of concepts in biology, chemistry, earth and space science, and physics, and of the interrelationships between science, technology, society, and the environment. Students are also given opportunities to further develop their scientific investigation skills."},
        {"courseName":"Food and Nutrition", "courseCode":"HFN201", "courseDiscription":"Students will learn how to make informed food choices and how to prepare foods, and will investigate our Canadian food heritage and food industries, as well as global food issues."},
        {"courseName":"Construction Technology", "courseCode":"TCJ201", "courseDiscription":"These courses enable students to develop technical knowledge and skills related to carpentry, masonry, electrical systems, heating and cooling, and plumbing for residential construction."},
        {"courseName":"Transportation Technology", "courseCode":"TTJ201", "courseDiscription":"This course provides students with opportunities to apply a design process to meet a variety of technological challenges. Students will research projects, create designs, build models and/or prototypes, and assess products and/or processes using appropriate tools, techniques, and strategies."},
        {"courseName":"Computer Technology", "courseCode":"TEJ201", "courseDiscription":"Students will build small electronic circuits and write computer programs to control simple peripheral devices or robots. Students will also develop an awareness of related environmental and societal issues, and will learn about secondary and postsecondary pathways and career opportunities in computer technology. Al."}

    ],

    "grade11":[
        {"couresName":"World Religions", "courseCode":"HRF3O1", "courseDiscription": "This course enables students to study world religions and belief traditions in local, Canadian and global contexts. Students will explore aspects of the human quest for meaning and will examine world religions and belief traditions as exemplified in various sacred teachings and principles, rites and passages."},
        {"couresName":"Food & Culture", "courseCode":"HFC3M1", "courseDiscription": "Grade 11 Food and Culture focuses on the foods, flavours, cooking techniques, and cultural traditions of global cuisines. In this course, students will develop practical cooking and food-related etiquette skills as they explore the origins and development of diverse food traditions, examining how Canadian food choices and traditions have been influenced by other cultures."},
        {"couresName":"Introduction to Anthropology & Psychology and Sociology", "courseCode":"HSP3U1", "courseDiscription": "This course provides students with opportunities to think critically about theories, questions, and issues related to anthropology, psychology, and sociology. Students will develop an understanding of the approaches and researchmethods used by social scientists. They will be given opportunities to explore theories from a variety of perspectives, to conduct social science research, and to become familiar with current thinking on a range of issues within the three disciplines"},
        {"courseName":"Canadian History since World War I", "courseCode":"CHC2D1", "courseDiscription": "This course explores social, economic, and political developments and events and their impact on the lives of different individuals, groups, and communities, including First Nations, Métis, and Inuit individuals and communities, in Canada since 1914."},
        {"courseName":"American History", "courseCode":"CHA3U1", "courseDiscription": "Students will conduct research and analysis, and communicate, in a variety of ways, their knowledge and understanding of the country that is Canada's neighbour and most important cultural influence and economic partner."},
        {"couresName":"Canadian Law", "courseCode":"CLU3M1", "courseDiscription": "This course explores legal issues that directly affect students' lives. To develop an appreciation of the. Canadian legal system, students examine the historical roots of Canadian law and expand on their. understanding of the role of government in making laws."},
        {"courseName":"English, Grade 11, College Preparation", "courseCode":"ENG3CE", "courseDiscription": "Students will study the content, form, and style of a variety of informational and graphic texts, as well as literary texts from Canada and other countries, and create oral, written, and media texts in a variety of forms for practical and academic purposes."},
        {"couresName":"English, Grade 11, University Preparation", "courseCode":"ENG3U1", "courseDiscription": "This course emphasizes the development of literacy, communication, and critical and creative thinking skills necessary for success in academic and daily life."},
        {"courseName":"Grade 11 Presentation and Speaking Skills", "courseCode":"EPS3O1", "courseDiscription": "Course Description: This course emphasizes the knowledge and skills required to plan and make effective presentations and to speak effectively in both formal and informal contexts, using such forms as reports, speeches, debates, panel discussions, storytelling, interviews, and multimedia presentations."},
        {"couresName":"French Grade 11, University", "courseCode":"FSF3U1", "courseDiscription": "Students will develop their listening, speaking, reading, and writing skills, as well as their creative and critical thinking skills, through responding to and exploring a variety of oral and written texts."},
        {"courseName":"Health and Physical Education ", "courseCode":"PAI3O1", "courseDiscription": "This course emphasizes regular participation in a variety of enjoyable individual and small group activities that promote life-long healthy active living. Student learning will include the application of movement principles to refine individual and small group skills (e.g. racquet sports, cross country skiing, orienteering, etc), participation in a variety of activities that enhance personal competence, fitness and health and the examination of issues related to healthy living. Reference should be made to the Healthy Active Living Education open course descriptions for Grades 10, 11 and 12 for health areas of study."},
        {"courseName":"Personal and Fitness Activities- Body Shop", "courseCode":"PAF3OF/M", "courseDiscription": "This course focuses on the development of a healthy lifestyle and participation in a variety of enjoyable physical activities that have the potential to engage students’ interest throughout their lives. Students will be encouraged to develop personal competence in a variety of movement skills and will be given opportunities to practice goal-setting, decision-making, social, and interpersonal skills. Students will also study the components of healthy relationships, reproductive health, mental health, and personal safety."},
        {"couresName":"Healthy Active Living Education, Grade 11, Open", "courseCode":"PPL3OF/M", "courseDiscription": "This course focuses on the development of a healthy lifestyle and participation in a variety of enjoyable physical activities that have the potential to engage students’ interest throughout their lives. Students will be encouraged to develop personal competence in a variety of movement skills and will be given opportunities to practice goal-setting, decision-making, social, and interpersonal skills. Students will also study the components of healthy relationships, reproductive health, mental health, and personal safety."},
        {"couresName":"Functions, Grade 11, University / College Preparation", "courseCode":"MCF3M1", "courseDiscription": "This course enables students to broaden their under-standing of relations, extend their skills in multi-step problem solving, and continue to develop their abilities in abstract reasoning."},
        {"courseName":"Functions and Relations, Grade 11, University Preparation", "courseCode":"MCR3U1", "courseDiscription": "This course introduces some financial applications of mathematics, extends students' experiences with functions, and introduces second-degree relations."},
        {"couresName":"Foundations of College Mathematics, Grade 11 ", "courseCode":"MBF3C1", "courseDiscription": "This course enables students to broaden their understanding of mathematics as a problemsolving tool in the real world. Students will extend their understanding of quadratic relations; investigate situations involving exponential growth; solve problems involving compound interest; solve financial problems connected with vehicle ownership; develop their ability to reason by collecting, analysing, and evaluating data involving one variable; connect probability and statistics; and solve problems in geometry and trigonometry. Students will consolidate their mathematical skills as they solve problems and communicate their thinking."},
        {"couresName":"Mathematics for Everyday Life, Grade 11, Workplace Preparation", "courseCode":"MEL3E1", "courseDiscription": "This MEL3E grade 11 math course enables students to broaden their understanding of mathematics as it is applied in the workplace and daily life. Students will solve problems associated with earning money, paying taxes, stock trading uk, and making purchases."},
        {"couresName":"Biology Grade 11, University", "courseCode":"SBI3U1", "courseDiscription": "This course furthers students' understanding of the processes that occur in biological systems. Students will study theory and conduct investigations in the areas of biodiversity; evolution; genetic processes; the structure and function of animals; and the anatomy, growth, and function of plants."},
        {"courseName":"Chemistry, Grade 11, University", "courseCode":"SCH3U1", "courseDiscription": "This course enables students to deepen their understanding of chemistry through the study of the properties of matter and chemical bonds; chemical reactions and quantitative relationships in those reactions; solutions and solubility; and atmospheric chemistry and the behaviour of gases."},
        {"courseName":"Physics, Grade 11, University", "courseCode":"SPH3U1", "courseDiscription": "This course develops students understanding of the basic concepts of physics. Students will explore kinematics, with an emphasis on linear motion; different kinds of forces; energy transformations; the properties of mechanical waves and sound; and electricity and magnetism."},
        {"courseName":"Grade 11 Environmental Science", "courseCode":"SVN3E1", "courseDiscription": "Grade 11 Environmental Science allows students to develop their fundamental scientific knowledge and skills. SVN3E explores current topics in environmental science and places emphasis on practical applications of scientific and mathematical literacy."},
        {"couresName":"This course enables students to study world religions and belief traditions in local, Canadian and global contexts. Students will explore aspects of the human quest for meaning and will examine world religions and belief traditions as exemplified in various sacred teachings and principles, rites and passages. They will also study the interaction throughout history between society and various belief traditions and will have opportunities to develop research and inquiry skills related to the study of world religions and belief traditions.", "courseCode":"HRF3O1", "courseDiscription": "This course enables students to study world religions and belief traditions in local, Canadian and global contexts. Students will explore aspects of the human quest for meaning and will examine world religions and belief traditions as exemplified in various sacred teachings and principles, rites and passages."},
        {"couresName":"Grade 11 Food And Culture", "courseCode":"HFC3M1", "courseDiscription": "Grade 11 Food and Culture focuses on the foods, flavours, cooking techniques, and cultural traditions of global cuisines. In this course, students will develop practical cooking and food-related etiquette skills as they explore the origins and development of diverse food traditions, examining how Canadian food choices and traditions have been influenced by other cultures."},
        {"couresName":"Introduction to Anthropology, Psychology and Sociology", "courseCode":"HSP3U1", "courseDiscription": "This course provides students with opportunities to think critically about theories, questions, and issues related to anthropology, psychology, and sociology. Students will develop an understanding of the approaches and research methods used by social scientists. They will be given opportunities to explore theories from a variety of perspectives, to conduct social science research, and to become familiar with current thinking on a range of issues within the three disciplines"},
        {"couresName":"Philosophy: The Big Questions, Grade 11", "courseCode":"HZB3M1", "courseDiscription": "This course encourages exploration of philosophy’s big questions, such as: What is a meaningful life? What separates right from wrong? What constitutes knowledge? What makes something beautiful? What is a just society? Students will develop critical thinking and philosophical reasoning skills as they identify and analyse the responses of philosophers to the big questions and formulate their own responses to them. Students will explore the relevance of philosophical questions to society and to their everyday life. They will develop research and inquiry skills as they investigate various topics in philosophy."},
        {"courseName":"Construction Technology, Grade 11, College and Preparation", "courseCode":"TCJ3C1", "courseDiscription": "This course focuses on residential, commercial, and/or recreational construction, emphasizing practical workplace applications, the development of generic employment skills, and preparation for apprenticeship and training programs."},
        {"couresName":"Computer Engineering Technology", "courseCode":"TEJ3M1", "courseDiscription": "Student will learn how to solve problems, and will study the functions of key computer components and peripherals, logic gates, fundamental programming concepts, internal numbering and character representation systems, and operating systems and networks."},
        {"courseName":"Computer Engineering", "courseCode":"TEJ2O1 ", "courseDiscription": "This course introduces students to computer systems, networking, and interfacing, as well as electronics and robotics. Students will assemble, repair, and configure computers with various types of operating systems and application software."}
    ],

    "grade12":[
        {"courseName":"Drama", "courseCode":"ADA4M1", "courseDiscription": "This course requires students to experiment individually and collaboratively with forms and conventions of both drama and theatre from various cultures and time periods."},
        {"couresName":"Dramatic Arts grade 12", "courseCode":"AMI4M1", "courseDiscription": "This course extends students' skills in listening, speaking, reading, and writing in English for a variety of everyday and academic purposes. Students will make short classroom presentations; read a variety of adapted and original texts in English; and write using a variety of forms of text."},
        {"couresName":"Instrumental Music", "courseCode":"AMI3M1", "courseDiscription": "This course provides students with opportunities to develop their musical literacy through the creation, appreciation, analysis, and performance of music, including traditional, commercial, and art music."},
        {"couresName":"Music, Grade 12, University / College Preparation", "courseCode":"AMK4M1", "courseDiscription": "This course enables students to enhance their musical literacy through the creation, appreciation, analysis, and performance of music. Students will perform traditional, commercial, and art music, and will respond with insight to live and recorded performances. Students will enhance their understanding of the function of music in society and the impact of music on themselves and various communities and cultures. Students will analyse how to apply skills developed in music to their life and careers."},
        {"couresName":"Repertoire Grade 12, Mixed", "courseCode":"AMR4M1", "courseDiscription": "This course enables students to enhance their musical literacy through the creation, appreciation, analysis, and performance of music. Students will perform traditional, commercial, and art music, and will respond with insight to live and recorded performances."},
        {"couresName":"Grade 11 Photography", "courseCode":"AWQ3M1", "courseDiscription": "Below is the suggested sequence of course unit delivery as well as the recommended number of hours to complete the respective unit. For complete details of targeted expectations within each unit and activity, please see each Unit Overview found in the AWQ3M course profile."},
        {"couresName":"Principles of Financial Accounting, Grade 12,", "courseCode":"BAT4M1", "courseDiscription": "This course emphasizes study of accounting principles related to financial statements."},
        {"couresName":"Canadian and international law", "courseCode":"CLN4U1", "courseDiscription": "This course explores a range of contemporary legal issues and how they are addressed in both Canadian and international law."},
        {"couresName":"Environment and Natural Resource Management Grade 12", "courseCode":"CGR4M1", "courseDiscription": "Students will study the principles of sustainability & resource management and evaluate various approaches to achieving a more sustainable relationship between the environment and socio-economics. The course is organized into five strands: Geographic Foundations: Space and Systems."},
        {"couresName":"Grade 12, College Preparation", "courseCode":"ENG4C1", "courseDiscription": "This course emphasizes knowledge and skills related to the craft of writing. Students will analyse models of effective writing; use a workshop approach to produce a range of works; identify and use techniques required for specialized forms of writing; and identify effective ways to improve the quality of their writing."},
        {"couresName":"English, Grade 12, University Preparation", "courseCode":"ENG4U1", "courseDiscription": "This course emphasizes the consolidation of the literacy, communication, and critical and creative thinking skills necessary for success in academic and daily life."},
        {"couresName":"Core French, Grade 12, University Preparation", "courseCode":"FSF4U1", "courseDiscription": "This course provides extensive opportunities for students to speak and interact in French independently. Students will develop their listening, speaking, reading, and writing skills, apply language learning strategies in a wide variety of real-life situations, and develop their creative and critical thinking skills through responding to and interacting with a variety of oral and written texts. They will also enrich their understanding and appreciation of diverse French-speaking communities, and will develop skills necessary for lifelong language learning."},
        {"couresName":"Health and Physical Education", "courseCode":"PAF4OF/M", "courseDiscription": "This course emphasizes regular participation in a variety of enjoyable fitness activities that promote life-long healthy active living. Student learning will include the application of movement principles to refine their skills, participation in a variety of fitness activities (e.g. aerobics, weight training, jazzercise, self-defence etc) that enhance personal competence and health, and examination of issues related to healthy living. Reference should be made to the Healthy Active Living Education open course descriptions for Grades 10, 11 and 12 for health areas of study."},
        {"couresName":"Kinesiology Grade 12 University", "courseCode":"PSK4U1", "courseDiscription": "Students will learn about the effects of physical activity on health and performance, the evolution of physical activity and sports, and the factors that influence an individual's participation in physical activity."},
        {"couresName":"Interdisciplinary Studies: Data Science, Grade 12", "courseCode":"IDC4UM", "courseDiscription": "This course will help students develop and consolidate the skills required for and knowledge of different subjects and disciplines to solve problems, make decisions, create personal meaning, and present findings beyond the scope of a single subject or discipline. Students will apply the principles and processes of inquiry and research to effectively use a range of print, electronic, and mass media resources; to analyse historical innovations and exemplary research; and to investigate real-life situations and career opportunities in interdisciplinary endeavours. They will also assess their own cognitive and affective strategies, apply general skills in both familiar and new contexts, create innovative products, and communicate new knowledge."},
        {"couresName":"Foundations for College Mathematics Grade 12,", "courseCode":"MAP4C1", "courseDiscription": "data using statistical methods; solve problems involving applications of geometry and trigonometry; solve financial problems connected with annuities, budgets, and renting or owning accommodation; simplify expressions; and solve equations."},
        {"couresName":"Mathematics for Work and Everyday Life", "courseCode":"MEL4E1", "courseDiscription": "This course enables students to broaden their understanding of mathematics as it is applied in the workplace and daily life. Students will investigate questions involving the use of statistics; apply the concept of probability to solve problems involving familiar situations; investigate accommodation costs, create household budgets, and prepare a personal income tax return; use proportional reasoning; estimate and measure; and apply geometric concepts to create designs. Students will consolidate their mathematical skills as they solve problems and communicate their thinking."},
        {"couresName":"Calculus and Vectors", "courseCode":"MCV4U1", "courseDiscription": " From The Ontario Curriculum, Grades 11 and 12, Mathematics (Revised): 'This course builds on students' previous experience with functions and their developing understanding of rates of change'"},
        {"couresName":"Mathematics of Data Management, Grade 12, University Preparation", "courseCode":"MDM4U1", "courseDiscription": "This course broadens students’ understanding of mathematics as it relates to managing information. Students will apply methods for organizing large amounts of information; apply counting techniques, probability, and statistics in modeling and solving problems; and carry out a culminating project that integrates the expectations of the course and encourages perseverance and independence. Students planning to pursue university programs in business, the social sciences, or the humanities will find this course of particular interest."},
        {"couresName":"Functions and Applications", "courseCode":"MCF3M1", "courseDiscription": "Description: This course introduces basic features of the function by extending students experiences with quadratic relations. It focuses on quadratic, trigonometric, and exponential functions and their use in modelling real-world situations."},
        {"couresName":"Functions and Relations, Grade 11, University Preparation", "courseCode":"MCR3U1", "courseDiscription": "This course introduces some financial applications of mathematics, extends students' experiences with functions, and introduces second-degree relations."},
        {"couresName":"Biology Grade 12", "courseCode":"SBI4U1", "courseDiscription": "This course provides students with the opportunity for in-depth study of the concepts and processes associated with biological systems. Students will study theory and conduct investigations in the areas of biochemistry, metabolic processes, molecular genetics, homeostasis, and population dynamics."},
        {"couresName":"Chemistry, Grade 12, College Preparation", "courseCode":"SCH4C1", "courseDiscription": "This course introduces students to the concepts that form the basis of modern chemistry. Students will study qualitative analysis, quantitative relationships in chemi-cal reactions, organic chemistry and electrochemistry, and chemistry as it relates to the quality of the environ-ment."},
        {"couresName":"Chemistry, Grade 12, University Preparation", "courseCode":"SCH4U1", "courseDiscription": "This course provides students with the opportunity for in-depth study of the concepts and processes associated with biological systems. Students will study theory and conduct investigations in the areas of biochemistry, metabolic processes, molecular genetics, homeostasis, and population dynamics."},
        {"couresName":"Physics Grade 12", "courseCode":"SPH4U1", "courseDiscription": "This course enables students to deepen their understanding of physics concepts and theories. Students will continue their exploration of energy transformations and the forces that affect motion, and will investigate electrical, gravitational, and magnetic fields and electromagnetic radiation."},
        {"couresName":"Personal Lifestyle Management, Grade 12", "courseCode":"HIP4O1", "courseDiscription": "This course focuses on preparing students for living independently and working successfully with others. Students will learn to manage their personal resources to meet their basic needs for food, clothing, and housing."},
        {"couresName":"Social Sciences and the Humanities", "courseCode":"HFA4C1", "courseDiscription": "This course focuses on the relationship between nutrition and health at different stages of life and on global issues related to food production. Students will investigate the role of nutrition in health and disease and assess strategies for promoting food security and environmental responsibility. Students will learn about healthy eating, expand their repertoire of food-preparation techniques, and refine their ability to use social science research and inquiry methods to investigate topics related to nutrition and health."},
        {"couresName":"Nutrition and Health, Grade 12, University Preparation", "courseCode":"HFA4U1", "courseDiscription": "This course examines the relationships between food, energy balance, and nutritional status; the nutritional needs of individuals at different stages of life; and the role of nutrition in health and disease."},
        {"couresName":"Canadian and World Studies", "courseCode":"HSB4U1", "courseDiscription": "This course focuses on the use of social science theories, perspectives, and methodologies to investigate and explain shifts in knowledge, attitudes, beliefs, and behaviour and their impact on society."},
        {"couresName":"Philosophy: Questions and Theories, Grade 12, University Preparation", "courseCode":"HZT4U1", "courseDiscription": "This course enables students to acquire an understanding of the nature of philosophy and philosophical reasoning skills and to develop and apply their knowledge and skills while exploring specialized branches of philosophy (the course will cover at least three of the following branches: metaphysics, ethics, epistemology, philosophy of science, social & political philosophy, aesthetics). Students will develop critical thinking and philosophical reasoning skills as they formulate and evaluate arguments related to a variety of philosophical questions and theories. They will also develop research and inquiry skills related to the study and practice of philosophy"},
        {"couresName":"Transportation Technology, Grade 12, College Preparation", "courseCode":"TTJ4C1", "courseDiscription": "This course examines alternative modes of mass transit to enable students to develop the specialized knowledge and skills required to work with sophisticated land, air, and/or marine vehicles and transportation systems."},
        {"couresName":"Computer Engineering Technology Grade 12, University & College Preparation", "courseCode":"TEJ4M1", "courseDiscription": "This course describes the architecture, components, and operations of routers and switches in a small network. Students learn how to configure a router and a switch for basic functionality."}
    ],

    "special": [
        {"courseName":"English As a Second Language, ESL LEVEL 1, Open", "courseCode":"ESLAO8", "courseDiscription": "Level 1 English as a Second Language (ESLAO) builds on students previous education and language knowledge to introduce them to the English language and help them adjust to the diversity in their new environment. Students will use beginning English language skills in listening, speaking, reading, and writing for everyday and essential academic purposes. They will engage in short conversations using basic English language structures and simple sentence patterns; read short adapted texts; and write phrases and short sentences. The course also provides students with the knowledge and skills they need to begin to adapt to their new lives in Canada."},
        {"courseName":"English as a Second Language, ESL Level 2, Open", "courseCode":"ESLBO8", "courseDiscription": "Students will participate in conversations in structured situations on a variety of familiar and new topics; read a variety of texts designed or adapted for English language learners; expand their knowledge of English grammatical structures and sentence patterns; and link English sentences to compose paragraphs."},
        {"courseName":"English for School and Work, ESL Level 3, Open", "courseCode":"ESLCO8", "courseDiscription": "This course is designed to improve students' accuracy in using English in classroom situations, for personal and career planning, and to understand the changing world around them. Students will study and interpret a range of texts and produce a variety of forms of writing."},
        {"courseName":"English for School and Work, ESL Level 4, Open", "courseCode":"ESLDO8", "courseDiscription": "Course Overview. ESLDO online prepares students to use English with increasing fluency and accuracy in classroom and social situations and to participate in Canadian society as informed citizens. Students will develop the oral-presentation, reading, and writing skills required for success in all school subjects."},
        {"courseName":"Anna", "courseCode":"COOPPM", "courseDiscription": "This course consists of a learning experience connected to a community and a cooperative education curriculum focused on developing skills, knowledge, and habits of mind that will support students in their learning, including their education and career/life planning, at school and beyond, today and in the future."},
        {"courseName":"Anna", "courseCode":"OLC4O1", "courseDiscription": "This course is designed to help students acquire and demonstrate the cross-curricular literacy skills that are evaluated by the Ontario Secondary School Literacy Test (OSSLT). Students who complete the course successfully will meet the provincial literacy requirement for graduation."}

    ]
}